FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_GPIO.c
/*-------------------------------------------------------------------------*
 * File:  RX62N_GPIO.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the RX62N:GPIO:Interface.
 * Implementation:
 *      A single GPIO0 is created, but the code can be easily changed for
 *      other processors to use multiple GPIO busses.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://goo.gl/UDtTCR for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!   |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <Config.h>
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <Types/GPIO.h>
#include <HAL/GPIO.h>
#include <Source/Processor/Renesas/RX62N/RX62N_GPIO.h>
#include <stdio.h>

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    TUInt8 *iDDR; // Data Direction Register (input or output)
    TUInt8 *iDR; // Data Register (Output data)
    TUInt8 *iPORT; // Port Register (Input data)
    TUInt8 *iICR; // Input Buffer Control Register
    TUInt8 *iPCR; // Pull-Up MOS Control Register
    TUInt8 *iODR; // Open-Drain Control Register
} RX62N_GPIO_PInfo;

typedef struct {
    const HAL_GPIOPort *iHAL;
    const RX62N_GPIO_PInfo *iPortInfo;
	TUInt8 iLocked;
} T_RX62N_GPIO_Workspace;


const RX62N_GPIO_PInfo GPIO_RX62N_Port0_PortInfo = {
    (TUInt8 *)&PORT0.DDR,
    (TUInt8 *)&PORT0.DR,
    (TUInt8 *)&PORT0.PORT,
    (TUInt8 *)&PORT0.ICR,
    (TUInt8 *)0,
    (TUInt8 *)&PORT0.ODR };

const RX62N_GPIO_PInfo GPIO_RX62N_Port1_PortInfo = {
    (TUInt8 *)&PORT1.DDR,
    (TUInt8 *)&PORT1.DR,
    (TUInt8 *)&PORT1.PORT,
    (TUInt8 *)&PORT1.ICR,
    (TUInt8 *)0,
    (TUInt8 *)&PORT1.ODR };

const RX62N_GPIO_PInfo GPIO_RX62N_Port2_PortInfo = {
    (TUInt8 *)&PORT2.DDR,
    (TUInt8 *)&PORT2.DR,
    (TUInt8 *)&PORT2.PORT,
    (TUInt8 *)&PORT2.ICR,
    (TUInt8 *)0,
    (TUInt8 *)&PORT2.ODR };

const RX62N_GPIO_PInfo GPIO_RX62N_Port3_PortInfo = {
    (TUInt8 *)&PORT3.DDR,
    (TUInt8 *)&PORT3.DR,
    (TUInt8 *)&PORT3.PORT,
    (TUInt8 *)&PORT3.ICR,
    (TUInt8 *)0,
    (TUInt8 *)&PORT3.ODR };

const RX62N_GPIO_PInfo GPIO_RX62N_Port4_PortInfo = {
    (TUInt8 *)&PORT4.DDR,
    (TUInt8 *)&PORT4.DR,
    (TUInt8 *)&PORT4.PORT,
    (TUInt8 *)&PORT4.ICR,
    (TUInt8 *)0,
    (TUInt8 *)0 };

const RX62N_GPIO_PInfo GPIO_RX62N_Port5_PortInfo = {
    (TUInt8 *)&PORT5.DDR,
    (TUInt8 *)&PORT5.DR,
    (TUInt8 *)&PORT5.PORT,
    (TUInt8 *)&PORT5.ICR,
    (TUInt8 *)0,
    (TUInt8 *)0
};

const RX62N_GPIO_PInfo GPIO_RX62N_Port6_PortInfo = {
    (TUInt8 *)&PORT6.DDR,
    (TUInt8 *)&PORT6.DR,
    (TUInt8 *)&PORT6.PORT,
    (TUInt8 *)&PORT6.ICR,
    (TUInt8 *)0,
    (TUInt8 *)0
};

const RX62N_GPIO_PInfo GPIO_RX62N_Port7_PortInfo = {
    (TUInt8 *)&PORT7.DDR,
    (TUInt8 *)&PORT7.DR,
    (TUInt8 *)&PORT7.PORT,
    (TUInt8 *)&PORT7.ICR,
    (TUInt8 *)0,
    (TUInt8 *)0
};

const RX62N_GPIO_PInfo GPIO_RX62N_Port8_PortInfo = {
    (TUInt8 *)&PORT8.DDR,
    (TUInt8 *)&PORT8.DR,
    (TUInt8 *)&PORT8.PORT,
    (TUInt8 *)&PORT8.ICR,
    (TUInt8 *)0,
    (TUInt8 *)0
};

const RX62N_GPIO_PInfo GPIO_RX62N_Port9_PortInfo = {
    (TUInt8 *)&PORT9.DDR,
    (TUInt8 *)&PORT9.DR,
    (TUInt8 *)&PORT9.PORT,
    (TUInt8 *)&PORT9.ICR,
    (TUInt8 *)&PORT9.PCR,
    (TUInt8 *)0
};

const RX62N_GPIO_PInfo GPIO_RX62N_PortA_PortInfo = {
    (TUInt8 *)&PORTA.DDR,
    (TUInt8 *)&PORTA.DR,
    (TUInt8 *)&PORTA.PORT,
    (TUInt8 *)&PORTA.ICR,
    (TUInt8 *)&PORTA.PCR,
    (TUInt8 *)0
};

const RX62N_GPIO_PInfo GPIO_RX62N_PortB_PortInfo = {
    (TUInt8 *)&PORTB.DDR,
    (TUInt8 *)&PORTB.DR,
    (TUInt8 *)&PORTB.PORT,
    (TUInt8 *)&PORTB.ICR,
    (TUInt8 *)&PORTB.PCR,
    (TUInt8 *)0
};

const RX62N_GPIO_PInfo GPIO_RX62N_PortC_PortInfo = {
    (TUInt8 *)&PORTC.DDR,
    (TUInt8 *)&PORTC.DR,
    (TUInt8 *)&PORTC.PORT,
    (TUInt8 *)&PORTC.ICR,
    (TUInt8 *)&PORTC.PCR,
    (TUInt8 *)&PORTC.ODR
};

const RX62N_GPIO_PInfo GPIO_RX62N_PortD_PortInfo = {
    (TUInt8 *)&PORTD.DDR,
    (TUInt8 *)&PORTD.DR,
    (TUInt8 *)&PORTD.PORT,
    (TUInt8 *)&PORTD.ICR,
    (TUInt8 *)&PORTD.PCR,
    (TUInt8 *)0
};

const RX62N_GPIO_PInfo GPIO_RX62N_PortE_PortInfo = {
    (TUInt8 *)&PORTE.DDR,
    (TUInt8 *)&PORTE.DR,
    (TUInt8 *)&PORTE.PORT,
    (TUInt8 *)&PORTE.ICR,
    (TUInt8 *)&PORTE.PCR,
    (TUInt8 *)0
};

const RX62N_GPIO_PInfo GPIO_RX62N_PortF_PortInfo = {
    (TUInt8 *)&PORTF.DDR,
    (TUInt8 *)&PORTF.DR,
    (TUInt8 *)&PORTF.PORT,
    (TUInt8 *)&PORTF.ICR,
    (TUInt8 *)0,
    (TUInt8 *)0
};

const RX62N_GPIO_PInfo GPIO_RX62N_PortG_PortInfo = {
    (TUInt8 *)&PORTG.DDR,
    (TUInt8 *)&PORTG.DR,
    (TUInt8 *)&PORTG.PORT,
    (TUInt8 *)&PORTG.ICR,
    (TUInt8 *)&PORTG.PCR,
    (TUInt8 *)0
};

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_P0_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:Port0 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_P0_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_Port0_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_P1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:Port1 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_P1_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_Port1_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_P2_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:Port2 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_P2_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_Port2_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_P3_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:Port3 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_P3_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_Port3_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_P4_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:Port4 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_P4_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_Port4_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_P5_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:Port5 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_P5_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_Port5_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_P6_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:Port6 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_P6_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_Port6_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_P7_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:Port7 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_P7_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_Port7_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_P8_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:Port8 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_P8_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_Port8_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_P9_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:Port9 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_P9_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_Port9_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_PA_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:PortA workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_PA_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_PortA_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_PB_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:PortB workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_PB_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_PortB_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_PC_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:PortC workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_PC_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_PortC_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_PD_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:PortD workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_PD_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_PortD_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_PE_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:PortE workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_PE_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_PortE_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_PF_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:PortF workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_PF_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_PortF_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_PG_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N:GPIO:PortG workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_PG_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_RX62N_PortG_PortInfo;
	p->iLocked = 0;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_Configure
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare which pins on the GPIO port are usable.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aUsablePins         -- Pins allowed
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_Configure(void *aWorkspace, TUInt32 aUsablePins)
{
    //    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
	
    PARAM_NOT_USED(aUsablePins);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_Activate
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare which pins on the GPIO port are active as GPIO pins.
 *      Once active, the pins are set to GPIO inputs or outputs.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to activate
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_Activate(void *aWorkspace, TUInt32 aPortPins)
{
    // Defunc function
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_Deactivate
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare which pins on the GPIO port are inactive as GPIO pins.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to activate
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_Deactivate(void *aWorkspace, TUInt32 aPortPins)
{
    // Defunc function
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_SetOutputMode
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output mode.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output mode
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_SetOutputMode(void *aWorkspace, TUInt32 aPortPins)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    const RX62N_GPIO_PInfo *p_info = p->iPortInfo;

    // Make sure this port has data direction support
    if (!p_info->iDDR)
        return UEZ_ERROR_ILLEGAL_OPERATION;

