FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_GPIO.c
    if (aPortPinIndex >= 8)
        return UEZ_ERROR_INVALID_PARAMETER;
    if (aMux > 1)
        return UEZ_ERROR_INVALID_PARAMETER;

    // Make sure this port has pull-up support
    if (!p_info->iODR)
        return UEZ_ERROR_ILLEGAL_OPERATION;

    // Set the open drain to on or off
    if (aMux == 1) {
        (*p_info->iODR) |= (1 << aPortPinIndex);
    } else {
        // Turn off the pull up
        (*p_info->iODR) &= ~(1 << aPortPinIndex);
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_GPIO_GetMux
 *---------------------------------------------------------------------------*
 * Description:
 *      Get pin's mux feature.  1=pull-up is on, 0=pull-up is off.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt8 aPortPinIndex        -- Index to pin 0-7
 *      T_gpioMux *aMux             -- Returned mux option (0=io pin, 1=peripheral)
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_GPIO_GetMux(
    void *aWorkspace,
    TUInt8 aPortPinIndex,
    T_gpioMux *aMux)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    const RX62N_GPIO_PInfo *p_info = p->iPortInfo;

    // Default is generic i/o (pull-up is off)
    *aMux = 0;

    if (aPortPinIndex >= 8)
        return UEZ_ERROR_INVALID_PARAMETER;

    // Make sure this port has pull-up support
    if (!p_info->iODR)
        return UEZ_ERROR_ILLEGAL_OPERATION;

    // Set port mode register
    if ((*p_info->iODR) & (1 << aPortPinIndex)) {
        // Pin is for pull-up is on
        *aMux = 1;
    } else {
        // Pin is for pull-up is off
        *aMux = 0;
    }

    return UEZ_ERROR_NONE;
}
T_uezError RX62N_GPIO_Control(
        void *aWorkspace,
        TUInt8 aPortPinIndex,
        T_gpioControl aControl,
        TUInt32 aValue)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    const RX62N_GPIO_PInfo *p_info = p->iPortInfo;

    PARAM_NOT_USED(aValue);

    // Look up the IOCON register
    switch (aControl) {
        case GPIO_NOP:
            // Yep, do no operation
            break;
        case GPIO_CONTROL_ENABLE_INPUT_BUFFER:
            if (!p_info->iICR)
                return UEZ_ERROR_ILLEGAL_OPERATION;
            (*p_info->iICR) |= (1<<aPortPinIndex);
            break;
        case GPIO_CONTROL_DISABLE_INPUT_BUFFER:
            if (!p_info->iICR)
                return UEZ_ERROR_ILLEGAL_OPERATION;
            (*p_info->iICR) &= ~(1<<aPortPinIndex);
            break;
        default:
            return UEZ_ERROR_NOT_SUPPORTED;
    }
    return UEZ_ERROR_NONE;
}

T_uezError RX62N_GPIO_ConfigureInterruptCallbackNotSupported(
    void *aWorkspace,
    TUInt32 aPortPins,
    T_gpioInterruptHandler iInterruptCallback,
    void *iInterruptCallbackWorkspace)
{
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError RX62N_GPIO_EnableInterruptsNotSupported(
    void *aWorkspace,
    TUInt32 aPortPins,
    T_gpioInterruptType aType)
{
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError RX62N_GPIO_DisableInterruptsNotSupported(
    void *aWorkspace,
    TUInt32 aPortPins,
    T_gpioInterruptType aType)
{
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError RX62N_GPIO_ClearInterruptsNotSupported(
    void *aWorkspace,
    TUInt32 aPortPins)
{
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError RX62N_GPIO_Lock(void *aWorkspace, TUInt32 aPortPins)
{
#ifndef NDEBUG
    char buffer [50];
#endif
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;
    // Any pins already locked?
    if (p->iLocked & aPortPins) {
        #ifndef NDEBUG
          sprintf (buffer, "PinLock on %s Pin %d", p->iHAL->iInterface.iName, aPortPins);
          UEZFailureMsg(buffer);
        #else
          UEZFailureMsg("PinLock");
        #endif
        return UEZ_ERROR_NOT_AVAILABLE;
    }
    p->iLocked |= aPortPins;
    return UEZ_ERROR_NONE;
}

T_uezError RX62N_GPIO_Unlock(void *aWorkspace, TUInt32 aPortPins)
{
    T_RX62N_GPIO_Workspace *p = (T_RX62N_GPIO_Workspace *)aWorkspace;

    p->iLocked &= ~aPortPins;
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * HAL Interface tables:
 *---------------------------------------------------------------------------*/
const HAL_GPIOPort GPIO_RX62N_Port0_Interface = {
    "RX62N:GPIO:Port 0",
    0x0100,
    RX62N_GPIO_P0_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
	RX62N_GPIO_Unlock,
	/* uEZ v2.04 */
	RX62N_GPIO_GetMux
};

const HAL_GPIOPort GPIO_RX62N_Port1_Interface = {
    "RX62N:GPIO:Port 1",
    0x0100,
    RX62N_GPIO_P1_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
    RX62N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX62N_GPIO_GetMux
};

const HAL_GPIOPort GPIO_RX62N_Port2_Interface = {
    "RX62N:GPIO:Port 2",
    0x0100,
    RX62N_GPIO_P2_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

