FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_GPIO.c
    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
    RX62N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX62N_GPIO_GetMux
};

const HAL_GPIOPort GPIO_RX62N_Port3_Interface = {
    "RX62N:GPIO:Port 3",
    0x0100,
    RX62N_GPIO_P3_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
    RX62N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX62N_GPIO_GetMux
};

const HAL_GPIOPort GPIO_RX62N_Port4_Interface = {
    "RX62N:GPIO:Port 4",
    0x0100,
    RX62N_GPIO_P4_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
    RX62N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX62N_GPIO_GetMux
};

const HAL_GPIOPort GPIO_RX62N_Port5_Interface = {
    "RX62N:GPIO:Port 5",
    0x0100,
    RX62N_GPIO_P5_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
    RX62N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX62N_GPIO_GetMux
};

const HAL_GPIOPort GPIO_RX62N_Port6_Interface = {
    "RX62N:GPIO:Port 6",
    0x0100,
    RX62N_GPIO_P6_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
    RX62N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX62N_GPIO_GetMux
};

const HAL_GPIOPort GPIO_RX62N_Port7_Interface = {
    "RX62N:GPIO:Port 7",
    0x0100,
    RX62N_GPIO_P7_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
    RX62N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX62N_GPIO_GetMux
};

const HAL_GPIOPort GPIO_RX62N_Port8_Interface = {
    "RX62N:GPIO:Port 8",
    0x0100,
    RX62N_GPIO_P8_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
    RX62N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX62N_GPIO_GetMux
};

const HAL_GPIOPort GPIO_RX62N_Port9_Interface = {
    "RX62N:GPIO:Port 9",
    0x0100,
    RX62N_GPIO_P9_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
    RX62N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX62N_GPIO_GetMux
};

const HAL_GPIOPort GPIO_RX62N_PortA_Interface = {
    "RX62N:GPIO:Port A",
    0x0100,
    RX62N_GPIO_PA_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
    RX62N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX62N_GPIO_GetMux
};

const HAL_GPIOPort GPIO_RX62N_PortB_Interface = {
    "RX62N:GPIO:Port B",
    0x0100,
    RX62N_GPIO_PB_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
    RX62N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX62N_GPIO_GetMux
};

const HAL_GPIOPort GPIO_RX62N_PortC_Interface = {
    "RX62N:GPIO:Port C",
    0x0100,
    RX62N_GPIO_PC_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

