FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_GPIO.c
    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
    RX62N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX62N_GPIO_GetMux
};

const HAL_GPIOPort GPIO_RX62N_PortD_Interface = {
    "RX62N:GPIO:Port D",
    0x0100,
    RX62N_GPIO_PD_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
    RX62N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX62N_GPIO_GetMux
};

const HAL_GPIOPort GPIO_RX62N_PortE_Interface = {
    "RX62N:GPIO:Port E",
    0x0100,
    RX62N_GPIO_PE_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
    RX62N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX62N_GPIO_GetMux
};

const HAL_GPIOPort GPIO_RX62N_PortF_Interface = {
    "RX62N:GPIO:Port F",
    0x0100,
    RX62N_GPIO_PF_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
    RX62N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX62N_GPIO_GetMux
};

const HAL_GPIOPort GPIO_RX62N_PortG_Interface = {
    "RX62N:GPIO:Port G",
    0x0100,
    RX62N_GPIO_PG_InitializeWorkspace,
    sizeof(T_RX62N_GPIO_Workspace),

    0,
    0,
    0,
    RX62N_GPIO_SetOutputMode,
    RX62N_GPIO_SetInputMode,
    RX62N_GPIO_Set,
    RX62N_GPIO_Clear,
    RX62N_GPIO_Read,
    RX62N_GPIO_SetPull,
    RX62N_GPIO_SetMux,

    RX62N_GPIO_ConfigureInterruptCallbackNotSupported,
    RX62N_GPIO_EnableInterruptsNotSupported,
    RX62N_GPIO_DisableInterruptsNotSupported,
    RX62N_GPIO_ClearInterruptsNotSupported,

    RX62N_GPIO_Control,
	RX62N_GPIO_Lock,
    RX62N_GPIO_Unlock,
    /* uEZ v2.04 */
    RX62N_GPIO_GetMux
};

void RX62N_GPIO_P0_Require(void)
{
    HAL_GPIOPort **p_gpio0;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO0",
            (T_halInterface *)&GPIO_RX62N_Port0_Interface, 0,
            (T_halWorkspace **)&p_gpio0);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_0, p_gpio0);
}

void RX62N_GPIO_P1_Require(void)
{
    HAL_GPIOPort **p_gpio1;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO1",
            (T_halInterface *)&GPIO_RX62N_Port1_Interface, 0,
            (T_halWorkspace **)&p_gpio1);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_1, p_gpio1);
}

void RX62N_GPIO_P2_Require(void)
{
    HAL_GPIOPort **p_gpio2;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO2",
            (T_halInterface *)&GPIO_RX62N_Port2_Interface, 0,
            (T_halWorkspace **)&p_gpio2);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_2, p_gpio2);
}

void RX62N_GPIO_P3_Require(void)
{
    HAL_GPIOPort **p_gpio3;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO3",
            (T_halInterface *)&GPIO_RX62N_Port3_Interface, 0,
            (T_halWorkspace **)&p_gpio3);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_3, p_gpio3);
}

void RX62N_GPIO_P4_Require(void)
{
    HAL_GPIOPort **p_gpio4;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO4",
            (T_halInterface *)&GPIO_RX62N_Port4_Interface, 0,
            (T_halWorkspace **)&p_gpio4);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_4, p_gpio4);
}

void RX62N_GPIO_P5_Require(void)
{
    HAL_GPIOPort **p_gpio5;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO5",
            (T_halInterface *)&GPIO_RX62N_Port5_Interface, 0,
            (T_halWorkspace **)&p_gpio5);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_5, p_gpio5);
}

void RX62N_GPIO_P6_Require(void)
{
    HAL_GPIOPort **p_gpio6;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO6",
            (T_halInterface *)&GPIO_RX62N_Port6_Interface, 0,
            (T_halWorkspace **)&p_gpio6);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_6, p_gpio6);
}

void RX62N_GPIO_P7_Require(void)
{
    HAL_GPIOPort **p_gpio7;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO7",
            (T_halInterface *)&GPIO_RX62N_Port7_Interface, 0,
            (T_halWorkspace **)&p_gpio7);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_7, p_gpio7);
}

void RX62N_GPIO_P8_Require(void)
{
    HAL_GPIOPort **p_gpio8;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO8",
            (T_halInterface *)&GPIO_RX62N_Port8_Interface, 0,
            (T_halWorkspace **)&p_gpio8);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_8, p_gpio8);
}

void RX62N_GPIO_P9_Require(void)
{
    HAL_GPIOPort **p_gpio9;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO9",
            (T_halInterface *)&GPIO_RX62N_Port9_Interface, 0,
            (T_halWorkspace **)&p_gpio9);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_9, p_gpio9);
}

void RX62N_GPIO_PA_Require(void)
{
    HAL_GPIOPort **p_gpioA;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIOA",
            (T_halInterface *)&GPIO_RX62N_PortA_Interface, 0,
            (T_halWorkspace **)&p_gpioA);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_A, p_gpioA);
}

void RX62N_GPIO_PB_Require(void)
{
    HAL_GPIOPort **p_gpioB;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIOB",
            (T_halInterface *)&GPIO_RX62N_PortB_Interface, 0,
            (T_halWorkspace **)&p_gpioB);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_B, p_gpioB);
}

void RX62N_GPIO_PC_Require(void)
{
    HAL_GPIOPort **p_gpioC;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIOC",
            (T_halInterface *)&GPIO_RX62N_PortC_Interface, 0,
            (T_halWorkspace **)&p_gpioC);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_C, p_gpioC);
}

void RX62N_GPIO_PD_Require(void)
{
    HAL_GPIOPort **p_gpioD;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIOD",
            (T_halInterface *)&GPIO_RX62N_PortD_Interface, 0,
            (T_halWorkspace **)&p_gpioD);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_D, p_gpioD);
}

void RX62N_GPIO_PE_Require(void)
{
    HAL_GPIOPort **p_gpioE;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIOE",
            (T_halInterface *)&GPIO_RX62N_PortE_Interface, 0,
            (T_halWorkspace **)&p_gpioE);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_E, p_gpioE);
}

void RX62N_GPIO_PF_Require(void)
{
    HAL_GPIOPort **p_gpioF;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIOF",
            (T_halInterface *)&GPIO_RX62N_PortF_Interface, 0,
            (T_halWorkspace **)&p_gpioF);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_F, p_gpioF);
}

void RX62N_GPIO_PG_Require(void)
{
    HAL_GPIOPort **p_gpioG;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIOG",
            (T_halInterface *)&GPIO_RX62N_PortG_Interface, 0,
            (T_halWorkspace **)&p_gpioG);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_G, p_gpioG);
}

/*-------------------------------------------------------------------------*
 * End of File:  GPIO.c
 *-------------------------------------------------------------------------*/
